nxp-mcuxpresso/mcux-soc-svd/MIMXRT1015/MIMXRT1015.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PIT</name>
      <description>PIT</description>
      <groupName>PIT</groupName>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x140</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PIT</name>
        <value>122</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>PIT Module Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRZ</name>
              <description>Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>t000001</name>
                  <description>Timers continue to run in Debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>t0000011</name>
                  <description>Timers are stopped in Debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable for PIT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>t0301</name>
                  <description>Clock for standard PIT timers is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>t00000111</name>
                  <description>Clock for standard PIT timers is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LTMR64H</name>
          <description>PIT Upper Lifetime Timer Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LTH</name>
              <description>Life Timer value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTMR64L</name>
          <description>PIT Lower Lifetime Timer Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LTL</name>
              <description>Life Timer value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>TIMER[%s]</name>
          <description>Array of registers: CVAL, LDVAL, TCTRL, TFLG</description>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>LDVAL</name>
            <description>Timer Load Value Register</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TSV</name>
                <description>Timer Start Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CVAL</name>
            <description>Current Timer Value Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TVL</name>
                <description>Current Timer Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCTRL</name>
            <description>Timer Control Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TEN</name>
                <description>Timer Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>t02981</name>
                    <description>Timer n is disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>t008981</name>
                    <description>Timer n is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIE</name>
                <description>Timer Interrupt Enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>t0331</name>
                    <description>Interrupt requests from Timer n are disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>t077711</name>
                    <description>Interrupt is requested whenever TIF is set.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHN</name>
                <description>Chain Mode</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>timer0001</name>
                    <description>Timer is not chained.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>timer0081</name>
                    <description>Timer is chained to a previous timer. For example, for channel 2, if this field is set, Timer 2 is chained to Timer 1.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TFLG</name>
            <description>Timer Flag Register</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
            <fields>
              <field>
                <name>TIF</name>
                <description>Timer Interrupt Flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>t0022331</name>
                    <description>Timeout has not yet occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>t0022332221</name>
                    <description>Timeout has occurred.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
