nxp-mcuxpresso/mcux-soc-svd/MIMXRT1015/MIMXRT1015.xml
        <register>
          <name>GPR8</name>
          <description>GPR8 General Purpose Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI2C1_IPG_STOP_MODE</name>
              <description>LPI2C1 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C1_IPG_DOZE</name>
              <description>LPI2C1 ipg_doze mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C2_IPG_STOP_MODE</name>
              <description>LPI2C2 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C2_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C2_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C2_IPG_DOZE</name>
              <description>LPI2C2 ipg_doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C2_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C2_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_IPG_STOP_MODE</name>
              <description>LPSPI1 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_IPG_DOZE</name>
              <description>LPSPI1 ipg_doze mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_IPG_STOP_MODE</name>
              <description>LPSPI2 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_IPG_DOZE</name>
              <description>LPSPI2 ipg_doze mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1_IPG_STOP_MODE</name>
              <description>LPUART1 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART1_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1_IPG_DOZE</name>
              <description>LPUART1 ipg_doze mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART1_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART2_IPG_STOP_MODE</name>
              <description>LPUART2 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART2_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART2_IPG_DOZE</name>
              <description>LPUART2 ipg_doze mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART2_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART3_IPG_STOP_MODE</name>
              <description>LPUART3 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART3_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART3_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART3_IPG_DOZE</name>
              <description>LPUART3 ipg_doze mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART3_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART3_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART4_IPG_STOP_MODE</name>
              <description>LPUART4 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART4_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART4_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART4_IPG_DOZE</name>
              <description>LPUART4 ipg_doze mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART4_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART4_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR9</name>
          <description>GPR9 General Purpose Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR10</name>
          <description>GPR10 General Purpose Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NIDEN</name>
              <description>Arm non-secure (non-invasive) debug enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NIDEN_0</name>
                  <description>Debug turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NIDEN_1</name>
                  <description>Debug enabled (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_EN</name>
              <description>Arm invasive debug enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_EN_0</name>
                  <description>Debug turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_EN_1</name>
                  <description>Debug enabled (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_ERR_RESP</name>
              <description>Security error response enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC_ERR_RESP_0</name>
                  <description>OKEY response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC_ERR_RESP_1</name>
                  <description>SLVError (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCPKEY_OCOTP_OR_KEYMUX</name>
              <description>DCP Key selection bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCPKEY_OCOTP_OR_KEYMUX_0</name>
                  <description>Select key from SNVS Master Key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCPKEY_OCOTP_OR_KEYMUX_1</name>
                  <description>Select key from OCOTP (SW_GP2)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_TZ_EN</name>
              <description>OCRAM TrustZone (TZ) enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_TZ_EN_0</name>
                  <description>The TrustZone feature is disabled. Entire OCRAM space is available for all access types (secure/non-secure/user/supervisor)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_TZ_EN_1</name>
                  <description>The TrustZone feature is enabled. Access to address in the range specified by [ENDADDR:STARTADDR] follows the execution mode access policy described in CSU chapter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_TZ_ADDR</name>
              <description>OCRAM TrustZone (TZ) start address</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_NIDEN</name>
              <description>Lock NIDEN field for changes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_NIDEN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_NIDEN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DBG_EN</name>
              <description>Lock DBG_EN field for changes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_DBG_EN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_DBG_EN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_SEC_ERR_RESP</name>
              <description>Lock SEC_ERR_RESP field for changes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_SEC_ERR_RESP_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_SEC_ERR_RESP_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DCPKEY_OCOTP_OR_KEYMUX</name>
              <description>Lock DCP Key OCOTP/Key MUX selection bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_DCPKEY_OCOTP_OR_KEYMUX_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_DCPKEY_OCOTP_OR_KEYMUX_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_OCRAM_TZ_EN</name>
              <description>Lock OCRAM_TZ_EN field for changes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_EN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_EN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_OCRAM_TZ_ADDR</name>
              <description>Lock OCRAM_TZ_ADDR field for changes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_ADDR_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_ADDR_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
