nxp-mcuxpresso/mcux-soc-svd/MIMXRT1015/MIMXRT1015.xml
        <register>
          <name>GPR22</name>
          <description>GPR22 General Purpose Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R2_BOT</name>
              <description>lock M7_APC_AC_R2_BOT field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_BOT_0</name>
                  <description>M7_APC_AC_R2_BOT is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_BOT_1</name>
                  <description>M7_APC_AC_R2_BOT is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R2_BOT</name>
              <description>Access Permission Controller (APC) end address of memory region-2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR23</name>
          <description>GPR23 General Purpose Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R2_TOP</name>
              <description>lock M7_APC_AC_R2_TOP field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_TOP_0</name>
                  <description>M7_APC_AC_R2_TOP is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_TOP_1</name>
                  <description>M7_APC_AC_R2_TOP is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R2_TOP</name>
              <description>Access Permission Controller (APC) start address of memory region-2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR24</name>
          <description>GPR24 General Purpose Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R3_BOT</name>
              <description>lock M7_APC_AC_R3_BOT field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_BOT_0</name>
                  <description>M7_APC_AC_R3_BOT is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_BOT_1</name>
                  <description>M7_APC_AC_R3_BOT is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R3_BOT</name>
              <description>Access Permission Controller (APC) end address of memory region-3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR25</name>
          <description>GPR25 General Purpose Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R3_TOP</name>
              <description>lock M7_APC_AC_R3_TOP field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_TOP_0</name>
                  <description>M7_APC_AC_R3_TOP is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_TOP_1</name>
                  <description>M7_APC_AC_R3_TOP is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R3_TOP</name>
              <description>Access Permission Controller (APC) start address of memory region-3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
