nxp-mcuxpresso/mcux-soc-svd/MIMXRT1015/MIMXRT1015.xml
        <register>
          <name>SCR</name>
          <description>System Control Register</description>
          <addressOffset>0xD10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>Indicates sleep-on-exit when returning from Handler mode to Thread mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEPONEXIT_0</name>
                  <description>o not sleep when returning to Thread mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEPONEXIT_1</name>
                  <description>enter sleep, or deep sleep, on return from an ISR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Controls whether the processor uses sleep or deep sleep as its low power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEPDEEP_0</name>
                  <description>sleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEPDEEP_1</name>
                  <description>deep sleep</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEVONPEND</name>
              <description>Send Event on Pending bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEVONPEND_0</name>
                  <description>only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVONPEND_1</name>
                  <description>enabled events and all interrupts, including disabled interrupts, can wakeup the processor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Configuration and Control Register</description>
          <addressOffset>0xD14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONBASETHRDENA</name>
              <description>Indicates how the processor enters Thread mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONBASETHRDENA_0</name>
                  <description>processor can enter Thread mode only when no exception is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONBASETHRDENA_1</name>
                  <description>processor can enter Thread mode from any level under the control of an EXC_RETURN value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USERSETMPEND</name>
              <description>Enables unprivileged software access to the STIR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USERSETMPEND_0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USERSETMPEND_1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNALIGN_TRP</name>
              <description>Enables unaligned access traps</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNALIGN_TRP_0</name>
                  <description>do not trap unaligned halfword and word accesses</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNALIGN_TRP_1</name>
                  <description>trap unaligned halfword and word accesses</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV_0_TRP</name>
              <description>Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_0_TRP_0</name>
                  <description>do not trap divide by 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_0_TRP_1</name>
                  <description>trap divide by 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFHFNMIGN</name>
              <description>Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFHFNMIGN_0</name>
                  <description>data bus faults caused by load and store instructions cause a lock-up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFHFNMIGN_1</name>
                  <description>handlers running at priority -1 and -2 ignore data bus faults caused by load and store instructions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STKALIGN</name>
              <description>Indicates stack alignment on exception entry</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STKALIGN_0</name>
                  <description>4-byte aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STKALIGN_1</name>
                  <description>8-byte aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC</name>
              <description>Enables L1 data cache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_0</name>
                  <description>L1 data cache disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_1</name>
                  <description>L1 data cache enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IC</name>
              <description>Enables L1 instruction cache.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IC_0</name>
                  <description>L1 instruction cache disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC_1</name>
                  <description>L1 instruction cache enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BP</name>
              <description>Always reads-as-one. It indicates branch prediction is enabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR1</name>
          <description>System Handler Priority Register 1</description>
          <addressOffset>0xD18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_4</name>
              <description>Priority of system handler 4, MemManage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_5</name>
              <description>Priority of system handler 5, BusFault</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_6</name>
              <description>Priority of system handler 6, UsageFault</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR2</name>
          <description>System Handler Priority Register 2</description>
          <addressOffset>0xD1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>Priority of system handler 11, SVCall</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR3</name>
          <description>System Handler Priority Register 3</description>
          <addressOffset>0xD20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_14</name>
              <description>Priority of system handler 14, PendSV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_15</name>
              <description>Priority of system handler 15, SysTick exception</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
